In [ ]:
#Q.1

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.shape

(891, 12)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
#Q.2
import pandas as pd

df = pd.DataFrame(
	[[1,2,3],
    [3,4,5],
    [6,7,8]],
    index = [1,2,3],
	columns=['A','B','C'])

index = df.index
for i in index:
    print(i)

1
2
3

In [23]:
#Q.3
import pandas as pd

Values = [10, 20, 30,40,50][0:2]

df = pd.DataFrame(Values)

print(df.sum())

0    30
dtype: int64

In [24]:
#Q.4
import pandas as pd
 
df = pd.DataFrame({'Text' : ['Music', 'Poetry', 'DataFrame', 'Comedy', 'columns'],
            'Word_Count' : ['5','6','9','6','7']})
 
print(df)

        Text Word_Count
0      Music          5
1     Poetry          6
2  DataFrame          9
3     Comedy          6
4    columns          7

In [ ]:
#Q.5
Size and shape of a dataframe in pandas python: Size of a dataframe is the number of fields in the 
dataframe which is nothing but number of rows * number of columns.
Shape of a dataframe gets the number of rows and number of columns of the dataframe.

In [ ]:
#Q.6
Pandas read_excel() function is used for reading the excel files.

In [25]:
#Q.7
import pandas as pd

In [29]:
df = pd.DataFrame({'email':['kkk@gmail.com','aa@yahoo.com']})
df['Username'] = df['email'].str.split('@').str[0]
print (df)

           email Username
0  kkk@gmail.com      kkk
1   aa@yahoo.com       aa

In [45]:
#Q.8
import pandas as pd
df =pd.DataFrame({'A':[3,8,6,2,9],
      'B':[5,2,9,3,1],
       'C':[1,7,4,5,2]})
print(df)

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [65]:
df['A'] = df['A'] > 5

In [66]:
df

       A  B  C
0  False  5  1
1  False  2  7
2  False  9  4
3  False  3  5
4  False  1  2

In [68]:
#Q.9
import pandas as pd
Values = [5, 9, 8, 5, 7, 8, 1, 2, 3, 4, 5, 6, 7, 8, 9, 5, 3]
df = pd.DataFrame(Values)
print(Values)

[5, 9, 8, 5, 7, 8, 1, 2, 3, 4, 5, 6, 7, 8, 9, 5, 3]

In [70]:
print(df.mean())

0    5.588235
dtype: float64

In [72]:
print(df.median())

0    5.0
dtype: float64

In [73]:
print(df.std())

0    2.45099
dtype: float64

In [74]:
#Q.10
import pandas as pd
df = pd.DataFrame({'Sales' : ['465', '676', '878', '432', '344'],
            'Date' : ['2022-05-06','2023-01-02','2023-02-06','2023-03-12','2023-03-20']})
print(df)

  Sales        Date
0   465  2022-05-06
1   676  2023-01-02
2   878  2023-02-06
3   432  2023-03-12
4   344  2023-03-20

In [94]:
MovingAverage = df['Sales'].rolling(7).mean()
print(df.join(MovingAverage , rsuffix='MovingAverage'))

  Sales        Date  MovinAverage  SalesMovingAverage
0   465  2022-05-06           NaN                 NaN
1   676  2023-01-02           NaN                 NaN
2   878  2023-02-06           NaN                 NaN
3   432  2023-03-12           NaN                 NaN
4   344  2023-03-20         559.0                 NaN

In [5]:
#Q.11
import pandas as pd
Date = ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
df = pd.DataFrame({'Date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
    ,'Weekday':['Sunday','Monday','Tuesday','Wednesday','Thursday']})
print(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [9]:
#Q.12
import pandas as pd
Date = ({'InsertedDates':["2023-01-01","2023-01-02","2023-01-03","2023-01-23","2023-01-18","2023-01-19","2023-01-31"]})
df = pd.DataFrame(Date)

In [17]:
start_date = '2023-01-01'
end_date = '2023-01-31'
mask = (df['InsertedDates'] > start_date) & (df['InsertedDates'] <= end_date)
df2 = df.loc[mask]
print(df2)

  InsertedDates
1    2023-01-02
2    2023-01-03
3    2023-01-23
4    2023-01-18
5    2023-01-19
6    2023-01-31

In [ ]:
#Q.13